#转义字符的应用
print('I\'m ok.')
print('I\'m learning\nPython.')
print('\\\n\\')

#字符串里面有很多字符都需要转义，就需要加很多\，为了简化，Python还允许用r''表示''内部的字符串默认不转义
print(r'\\\t\\')

#如果字符串内部有很多换行，用\n写在一行里不好阅读，为了简化，Python允许用'''...'''的格式表示多行内容
print('''line1
line2
line3''')

 #python是一种动态语言，变量类型不固定，变量名必须是大小写英文、数字和_的组合，且不能用数字开头
 #常量就是不能变的变量，比如常用的数学常数π就是一个常量。在Python中，通常用全部大写的变量名表示常量

 #精确的除法
print("普通除法10/3：%s"%(10/3))
print("地板除法10//3：%s"%(10//3))

#数据类型的转换
#input()所获取的输入内容均是字符串，使用时则需要进一步处理

print("\nplease input a number:")
a = input()
print("a/2=",int(a)/2)
